SOAPtoREST/map.json

{
	"mappings" : [
		{
		"method" : "GET",
		"routeTemplate" : "getCityWeatherByZip/{ZIP}",
		"soapAction" : "http://ws.cdyne.com/WeatherWS/GetCityWeatherByZIP",
		"soapBody" : "<?xml version=\"1.0\" encoding=\"utf-8\"?>
            <soap:Envelope xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\" xmlns:xsd=\"http://www.w3.org/2001/XMLSchema\" xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\">
                <soap:Body>
                    <GetCityWeatherByZIP xmlns=\"http://ws.cdyne.com/WeatherWS/\">
                        <ZIP>{ZIP}</ZIP>
                    </GetCityWeatherByZIP>
                </soap:Body>
            </soap:Envelope>",
		"soapUrl" : "http://wsf.cdyne.com/WeatherWS/Weather.asmx",
		"contentType" : "text/xml",
		
		},
		{
		"method" : "GET",
		"routeTemplate" : "getWeatherInformation",
		"soapAction" : "http://ws.cdyne.com/WeatherWS/GetWeatherInformation",
		"soapBody" : "<?xml version=\"1.0\" encoding=\"utf-8\"?>
            <soap:Envelope xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\" xmlns:xsd=\"http://www.w3.org/2001/XMLSchema\" xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\">
                <soap:Body>
                </soap:Body>
            </soap:Envelope>",
		"soapUrl" : "http://wsf.cdyne.com/WeatherWS/Weather.asmx",
		"contentType" : "text/xml",
		
		},
		{
		"method" : "GET",
		"routeTemplate" : "getCityForecastByZip/{ZIP}",
		"soapAction" : "http://ws.cdyne.com/WeatherWS/GetCityForecastByZIP",
		"soapBody" : "<?xml version=\"1.0\" encoding=\"utf-8\"?>
            <soap:Envelope xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\" xmlns:xsd=\"http://www.w3.org/2001/XMLSchema\" xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\">
                <soap:Body>
                    <GetCityForecastByZIP xmlns=\"http://ws.cdyne.com/WeatherWS/\">
                        <ZIP>{ZIP}</ZIP>
                    </GetCityForecastByZIP>
                </soap:Body>
            </soap:Envelope>",
		"soapUrl" : "http://wsf.cdyne.com/WeatherWS/Weather.asmx",
		"contentType" : "text/xml",
		
		}	
	]
}